/*
 * @file ADefine.h 声明天文算法中常用值与概念
 * @author         卢晓猛
 * @description    声明天文算法中常用量与数据类型
 * @version        2.0
 * @date           2016年12月19日
 * - 角度、弧度、角秒、毫角秒等相互转换因子与宏
 */

#ifndef ADEFINE_H_
#define ADEFINE_H_

#include <math.h>

namespace AstroUtil
{
///////////////////////////////////////////////////////////////////////////////
/// 角度<=>弧度<=>角秒<=>毫角秒
#define DPI			3.141592653589793238462643		//< 圆周率
#define D2PI		6.283185307179586476925287		//< 2倍圆周率

#define RtoD		5.729577951308232087679815E1	//< 弧度转换为角度的乘法因子
#define DtoR		1.745329251994329576923691E-2	//< 角度转换为弧度的乘法因子

#define RtoH		3.819718634205488058453210		//< 弧度转换为小时的乘法因子
#define HtoR		2.617993877991494365385536E-1	//< 小时转换为弧度的乘法因子

#define RtoS		1.375098708313975701043156E4	//< 弧度转换为秒的乘法因子
#define StoR		7.272205216643039903848712E-5	//< 秒转换为弧度的乘法因子

#define RtoAS		2.062648062470963551564734E5	//< 弧度转换为角秒的乘法因子
#define AStoR		4.848136811095359935899141E-6	//< 角秒转换为弧度的乘法因子

#define AStoD		2.777777777777777777777778E-4	//< 角秒转换为角度的乘法因子
#define DtoAS		3600.0							//< 角度转换为角秒的乘法因子

#define SEC2017		1483228800		//< 2017年1月1日0时相对1970年1月1日0时的秒数
///////////////////////////////////////////////////////////////////////////////
};

#endif /* ADEFINE_H_ */
